In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [2]:
ser1=Series(np.arange(3), index=['a', 'b', 'c'])

In [3]:
ser1=2*ser1

In [4]:
ser1

a    0
b    2
c    4
dtype: int32

In [6]:
ser1['b']

2

In [7]:
ser1[1]

2

In [8]:
ser1[0:3]

a    0
b    2
c    4
dtype: int32

In [9]:
ser1[['a','b']]

a    0
b    2
dtype: int32

In [10]:
ser1[ser1>3]

c    4
dtype: int32

In [11]:
ser1[ser1>3]=10

In [12]:
ser1

a     0
b     2
c    10
dtype: int32

In [17]:
dframe=DataFrame(np.arange(25).reshape((5,5)),index=['AMS','ATH','LA','PR', 'LDN'], columns=['a','b', 'c', 'd', 'e'])
dframe

      a   b   c   d   e
AMS   0   1   2   3   4
ATH   5   6   7   8   9
LA   10  11  12  13  14
PR   15  16  17  18  19
LDN  20  21  22  23  24

In [20]:
dframe[['b', 'c']]

      b   c
AMS   1   2
ATH   6   7
LA   11  12
PR   16  17
LDN  21  22

In [22]:
dframe[dframe['c']>10]
dframe

      a   b   c   d   e
AMS   0   1   2   3   4
ATH   5   6   7   8   9
LA   10  11  12  13  14
PR   15  16  17  18  19
LDN  20  21  22  23  24

In [23]:
dframe>10

         a      b      c      d      e
AMS  False  False  False  False  False
ATH  False  False  False  False  False
LA   False   True   True   True   True
PR    True   True   True   True   True
LDN   True   True   True   True   True

In [25]:
dframe.loc['ATH']

a    5
b    6
c    7
d    8
e    9
Name: ATH, dtype: int32